; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   yellow_block_2 yellow_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (and (not (and (ontable yellow_block_2) (not (= ?obj yellow_block_2)))) (not (and (ontable yellow_block_1) (not (= ?obj yellow_block_1))))) (hold_0)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (and (not (or (= ?obj yellow_block_2) (ontable yellow_block_2))) (not (or (= ?obj yellow_block_1) (ontable yellow_block_1)))) (hold_0)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
   grey_block_1 black_block_1 purple_block_1 - block
 )
 (:init (ontable yellow_block_1) (ontable grey_block_1) (on black_block_1 grey_block_1) (ontable yellow_block_2) (on purple_block_1 yellow_block_2) (clear yellow_block_1) (clear black_block_1) (clear purple_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (on grey_block_1 yellow_block_2) (hold_0)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack purple_block_1 yellow_block_2)
   deleted: (on purple_block_1 yellow_block_2) (clear purple_block_1) (handempty)
   added: (holding purple_block_1) (clear yellow_block_2)
   goals met: 0 of 2
2. (putdown purple_block_1)
   deleted: (holding purple_block_1)
   added: (clear purple_block_1) (handempty) (ontable purple_block_1)
   goals met: 0 of 2
3. (pickup yellow_block_2)
   deleted: (clear yellow_block_2) (ontable yellow_block_2) (handempty)
   added: (holding yellow_block_2)
   goals met: 0 of 2
4. (stack yellow_block_2 purple_block_1)
   deleted: (clear purple_block_1) (holding yellow_block_2)
   added: (handempty) (clear yellow_block_2) (on yellow_block_2 purple_block_1)
   goals met: 0 of 2
5. (unstack black_block_1 grey_block_1)
   deleted: (on black_block_1 grey_block_1) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear grey_block_1)
   goals met: 0 of 2
6. (putdown black_block_1)
   deleted: (holding black_block_1)
   added: (clear black_block_1) (handempty) (ontable black_block_1)
   goals met: 0 of 2
7. (pickup grey_block_1)
   deleted: (clear grey_block_1) (ontable grey_block_1) (handempty)
   added: (holding grey_block_1)
   goals met: 0 of 2
8. (stack grey_block_1 yellow_block_2)
   deleted: (clear yellow_block_2) (holding grey_block_1)
   added: (handempty) (clear grey_block_1) (on grey_block_1 yellow_block_2)
   goals met: 1 of 2
9. (pickup yellow_block_1)
   deleted: (clear yellow_block_1) (ontable yellow_block_1) (handempty)
   added: (holding yellow_block_1) (hold_0)
   goals met: 2 of 2
